InformationRegisters/ФактическиеЦеныНаРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФактическиеЦеныНаРесурсы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персонал</v8:Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФактическиеЦеныНаРесурсы/Ext/ManagerModule.bsl
Функция ПолучитьЦенуРесурса(ДатаРасчета, Организация, Ресурс, СтатьяЗатрат, Сценарий) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФактическиеЦеныНаРесурсыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ФактическиеЦеныНаРесурсы.СрезПоследних(
		|			&ДатаРасчета,
		|			Организация = &Организация
		|				И Ресурс = &Ресурс
		|				И СтатьяЗатрат = &СтатьяЗатрат
		|				И Сценарий = &Сценарий) КАК ФактическиеЦеныНаРесурсыСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	Запрос.УстановитьПараметр("СтатьяЗатрат", СтатьяЗатрат);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции
